fa-xbrl/src/InformationRegisters/velpo_CalculationData/velpo_CalculationData.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>velpo_CalculationData</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Value</name>
    <type>
      <types>Characteristic.velpo_ResourceIndicators</types>
    </type>
  </resources>
  <dimensions>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.velpo_BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.velpo_Economic</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RowNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Resource</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_ObjectAttributes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Indicator</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_ResourceIndicators</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fa-xbrl/src/InformationRegisters/velpo_CalculationData/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// FA-XBRL, Bookkeeping and XBRL proccessor
//
// @author: Paul Tarasov
//	@email: paul.tarasov@velpo.ru
// 
// Copyright (c) 2021 Paul Tarasov (Velpo)
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then
 
Function GetStructure() Export

	// import
	ClientServer = velpo_ClientServer; 
	                       
	Return ClientServer.GetCalculationDataStructure(); 	

EndFunction // GetItemStructure()

Function GetQueryText() Export
	
	QueryText =
	"SELECT
	|	CalculationData.Period AS Period,
	|	CalculationData.BusinessUnit AS BusinessUnit,
	|	CalculationData.Account AS Account,
	|	CalculationData.RowNumber AS RowNumber,
	|	CalculationData.Resource AS Resource,
	|	CalculationData.Indicator AS Indicator,
	|	CalculationData.Value AS Value
	|	//{FIELDS}
	|FROM
	|	InformationRegister.velpo_CalculationData AS CalculationData
	|	//{JOIN}
	|";

	Return QueryText;
	
EndFunction // GetCounterpartyDataQueryText()

Function GetFieldValue(RowStructure, Name, Period) Export
	
	 // import
	CalculationData = InformationRegisters.velpo_CalculationData;
	Server = velpo_Server; 

	Value = Undefined;
	
	If RowStructure.Property(Name, Value) Then
		Return Value;
	EndIf;
	
	// vars
	CurrentStructure = Server.GetRegisterDimensions(CalculationData);
	FillPropertyValues(CurrentStructure, RowStructure);
	Return CalculationData.Get(Period, CurrentStructure)[Name];		
		
EndFunction // GetFieldValue()

Function AddListRow(RowStructure, Period, Clone) Export
	
	// import
	CalculationData = InformationRegisters.velpo_CalculationData;
	Server = velpo_Server;
		
	// vars
	Record = Server.CreateListRow(CalculationData, RowStructure, Period, Clone);
	If Clone Then
		Record.Indicator = Undefined;
	EndIf;
	Record.Write(False);
	
	Return Record;
	
EndFunction // AddListRow(RowStructure, Period, Clone)

Procedure SetFieldValue(RowStructure, Name, Period, Value) Export
	
	 // import
	CalculationData = InformationRegisters.velpo_CalculationData;
	Server = velpo_Server; 
	
	Server.ChangeListRow(CalculationData, RowStructure, Name, Period, Value);
	
EndProcedure

Procedure SetDynamicList(List) Export
	
	// import
	Common = velpo_CommonFunctions;
	
	// vars
	ListProperties = Common.DynamicListPropertiesStructure();
	ListProperties.MainTable = "InformationRegister.velpo_CalculationData";
	ListProperties.DynamicDataRead = True;
	ListProperties.QueryText = GetQueryText();
	
	Common.SetDynamicListProperties(List, ListProperties);
	
EndProcedure

Procedure DeleteRows(RowStructure, Period) Export
	
	// import
	Server = velpo_Server;
	CalculationData = InformationRegisters.velpo_CalculationData;
	
	Server.DeleteRows(CalculationData, RowStructure, Period);

EndProcedure

#EndIf
